In [3]:
import pandas as pd

In [14]:
serie = pd.Series([4, 7, 6, 2])

serie

0    4
1    7
2    6
3    2
dtype: int64

In [15]:
serie.loc[1:2]

1    7
2    6
dtype: int64

In [ ]:
pd.Series()

In [ ]:
pd.Series([])

In [ ]:
pd.Series([3, 7, 5, 8])

In [ ]:
pd.Series([3, 7, 5, 8])

In [3]:
serie = pd.Series([3, 7, 5, 8])

serie

0    3
1    7
2    5
3    8
dtype: int64

In [4]:
serie.loc[2]

5

In [4]:
serie = pd.Series([3, 7, 5, 8], index=[10, 11, 12, 13])

serie

10    3
11    7
12    5
13    8
dtype: int64

In [5]:
serie.loc[12]

5

In [ ]:
serie[12]

In [17]:
serie = pd.Series([3, 7, 5, 8], index=['a', 'b', 'c', 'd'])

serie

a    3
b    7
c    5
d    8
dtype: int64

In [18]:
serie.loc['c']

5

In [19]:
serie.loc['c':]

c    5
d    8
dtype: int64

In [20]:
serie.loc['b'] = 100

serie

a      3
b    100
c      5
d      8
dtype: int64

In [21]:
serie.loc[['b', 'c']]

b    100
c      5
dtype: int64

In [22]:
serie = pd.Series([4, 7, 9, 5, 6, 0, 7, 2, 4, 5, 8])

serie

0     4
1     7
2     9
3     5
4     6
5     0
6     7
7     2
8     4
9     5
10    8
dtype: int64

In [23]:
serie.loc[5:]

5     0
6     7
7     2
8     4
9     5
10    8
dtype: int64

In [24]:
serie.loc[:5]

0    4
1    7
2    9
3    5
4    6
5    0
dtype: int64

In [25]:
serie.loc[3:7]

3    5
4    6
5    0
6    7
7    2
dtype: int64

In [ ]:
type(True)

In [ ]:
float_series = pd.Series([1.4, 3.5, 7.8, 9.8])

float_series

In [ ]:
bool_series = pd.Series([True, False, False, True])

bool_series

In [ ]:
str_series = pd.Series(['a', 'b', 'c', 'd'])

str_series

In [ ]:
obj_series = pd.Series(['a', 1, 3.5, True])

obj_series

In [ ]:
mixed_series = pd.Series([1, 3, True, False])

mixed_series

In [ ]:
int_series = pd.Series([1, 4, 7, 4])

int_series

In [11]:
data = {
    "Nombre": ["Woopsie Doopsies", "Omega-3", "Justin Bieber", "La Twinkle", "Rosaberta"],
    "Intensidad (1-10)": [5, 3, 8, 7, 2],
    "Es Parte de Nuestra Galaxia": [True, False, False, True, True],
    "Coleccionador que la encontró": ["Marco P.", "Marco P.", "Jenny", "Marco P.", "Jenny"]
}

In [12]:
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd', 'e'])

In [13]:
df

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró
a,Woopsie Doopsies,5,True,Marco P.
b,Omega-3,3,False,Marco P.
c,Justin Bieber,8,False,Jenny
d,La Twinkle,7,True,Marco P.
e,Rosaberta,2,True,Jenny

In [15]:
df[["Intensidad (1-10)", "Nombre"]]

   Intensidad (1-10)            Nombre
a                  5  Woopsie Doopsies
b                  3           Omega-3
c                  8     Justin Bieber
d                  7        La Twinkle
e                  2         Rosaberta

In [28]:
df[:]

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró
a,Woopsie Doopsies,5,True,Marco P.
b,Omega-3,3,False,Marco P.
c,Justin Bieber,8,False,Jenny
d,La Twinkle,7,True,Marco P.
e,Rosaberta,2,True,Jenny

In [29]:
df.loc['b']

Nombre                            Omega-3
Intensidad (1-10)                       3
Es Parte de Nuestra Galaxia         False
Coleccionador que la encontró    Marco P.
Name: b, dtype: object

In [30]:
df.loc[['a', 'b']]

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró
a,Woopsie Doopsies,5,True,Marco P.
b,Omega-3,3,False,Marco P.

In [31]:
df.loc['a', 'Nombre']

'Woopsie Doopsies'

In [32]:
df.loc[['a', 'b'], ['Nombre', 'Intensidad (1-10)']]

             Nombre  Intensidad (1-10)
a  Woopsie Doopsies                  5
b           Omega-3                  3

In [38]:
coleccionadores_correccion = pd.Series(['Jocolito Gutiérrez', 'Marco P.', 'Jenny', 'Jocolito Gutiérrez', 'Jenny'],
                                      index=['a', 'b', 'c', 'd', 'f'])

df['Coleccionador que la encontró'] = coleccionadores_correccion

df

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró
a,Woopsie Doopsies,5,True,Jocolito Gutiérrez
b,Omega-3,3,False,Marco P.
c,Justin Bieber,8,False,Jenny
d,La Twinkle,7,True,Jocolito Gutiérrez
e,Rosaberta,2,True,NaN

In [41]:
precio_en_rupias = pd.Series([25000, 500000, 4560000, 12000, 45000], index=df.index)

df['Precio en rupias'] = precio_en_rupias

df

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró,Precio en rupias
a,Woopsie Doopsies,5,True,Jocolito Gutiérrez,25000
b,Omega-3,3,False,Marco P.,500000
c,Justin Bieber,8,False,Jenny,4560000
d,La Twinkle,7,True,Jocolito Gutiérrez,12000
e,Rosaberta,2,True,NaN,45000

In [43]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [47]:
df_dropped = df.drop(columns=['Es Parte de Nuestra Galaxia', 'Precio en rupias'])

df_dropped

             Nombre  Intensidad (1-10) Coleccionador que la encontró
a  Woopsie Doopsies                  5            Jocolito Gutiérrez
b           Omega-3                  3                      Marco P.
c     Justin Bieber                  8                         Jenny
d        La Twinkle                  7            Jocolito Gutiérrez
e         Rosaberta                  2                           NaN

In [48]:
df

,Nombre,Intensidad (1-10),Es Parte de Nuestra Galaxia,Coleccionador que la encontró,Precio en rupias
a,Woopsie Doopsies,5,True,Jocolito Gutiérrez,25000
b,Omega-3,3,False,Marco P.,500000
c,Justin Bieber,8,False,Jenny,4560000
d,La Twinkle,7,True,Jocolito Gutiérrez,12000
e,Rosaberta,2,True,NaN,45000

In [49]:
import pandas as pd
import json

In [56]:
f = open('../Datasets/reviews_restaurantes.json', 'r')
data_json = json.load(f)
f.close()

In [59]:
df = pd.DataFrame.from_dict(data_json)

In [60]:
df

,has_online_delivery,price_range,currency,name,cuisines,location.address,location.city,user_rating.rating_text
0,1,3,Rs.,Hauz Khas Social,"Continental, American, Asian, North Indian","9-A & 12, Hauz Khas Village, New Delhi",New Delhi,Very Good
1,0,3,Rs.,Qubitos - The Terrace Cafe,"Thai, European, Mexican, North Indian, Chinese...","C-7, Vishal Enclave, Opposite Metro Pillar 417...",New Delhi,Excellent
2,1,2,Rs.,The Hudson Cafe,"Cafe, Italian, Continental, Chinese","2524, 1st Floor, Hudson Lane, Delhi University...",New Delhi,Very Good
3,0,3,Rs.,Summer House Cafe,"Italian, Continental","1st Floor, DDA Shopping Complex, Aurobindo Pla...",New Delhi,Very Good
4,0,3,Rs.,38 Barracks,"North Indian, Italian, Asian, American","M-38, Outer Circle, Connaught Place, New Delhi",New Delhi,Very Good
...,...,...,...,...,...,...,...,...
1175,0,3,£,The Boozy Cow,"Burger, Grill","17 Frederick Street, New Town, Edinburgh EH2 2EY",Edinburgh,Very Good
1176,0,3,£,La Favorita,Italian,"325-331 Leith Walk, Leith, Edinburgh EH6 8SA",Edinburgh,Excellent
1177,0,3,£,Roseleaf Bar Cafe,"Scottish, Cafe","23-24 Sandport Place, Leith, Edinburgh EH6 6EW",Edinburgh,Excellent
1178,0,3,£,Civerinos,"Pizza, Italian","5 Hunter Square, Royal Mile, Old Town, Edinbur...",Edinburgh,Good
1179,0,3,£,The Hanging Bat,American,"133 Lothian Road, Old Town, Edinburgh EH3 9AD",Edinburgh,Good

In [61]:
df.head()

,has_online_delivery,price_range,currency,name,cuisines,location.address,location.city,user_rating.rating_text
0,1,3,Rs.,Hauz Khas Social,"Continental, American, Asian, North Indian","9-A & 12, Hauz Khas Village, New Delhi",New Delhi,Very Good
1,0,3,Rs.,Qubitos - The Terrace Cafe,"Thai, European, Mexican, North Indian, Chinese...","C-7, Vishal Enclave, Opposite Metro Pillar 417...",New Delhi,Excellent
2,1,2,Rs.,The Hudson Cafe,"Cafe, Italian, Continental, Chinese","2524, 1st Floor, Hudson Lane, Delhi University...",New Delhi,Very Good
3,0,3,Rs.,Summer House Cafe,"Italian, Continental","1st Floor, DDA Shopping Complex, Aurobindo Pla...",New Delhi,Very Good
4,0,3,Rs.,38 Barracks,"North Indian, Italian, Asian, American","M-38, Outer Circle, Connaught Place, New Delhi",New Delhi,Very Good

In [62]:
df.head(10)

,has_online_delivery,price_range,currency,name,cuisines,location.address,location.city,user_rating.rating_text
0,1,3,Rs.,Hauz Khas Social,"Continental, American, Asian, North Indian","9-A & 12, Hauz Khas Village, New Delhi",New Delhi,Very Good
1,0,3,Rs.,Qubitos - The Terrace Cafe,"Thai, European, Mexican, North Indian, Chinese...","C-7, Vishal Enclave, Opposite Metro Pillar 417...",New Delhi,Excellent
2,1,2,Rs.,The Hudson Cafe,"Cafe, Italian, Continental, Chinese","2524, 1st Floor, Hudson Lane, Delhi University...",New Delhi,Very Good
3,0,3,Rs.,Summer House Cafe,"Italian, Continental","1st Floor, DDA Shopping Complex, Aurobindo Pla...",New Delhi,Very Good
4,0,3,Rs.,38 Barracks,"North Indian, Italian, Asian, American","M-38, Outer Circle, Connaught Place, New Delhi",New Delhi,Very Good
5,1,2,Rs.,Spezia Bistro,"Cafe, Continental, Chinese, Italian","2525, 1st Floor, Hudson Lane, Delhi University...",New Delhi,Excellent
6,0,4,Rs.,Manhattan Brewery & Bar Exchange,"Finger Food, American, Continental, North Indi...","1st Floor, Global Foyer Mall, Sector 43, Golf ...",Gurgaon,Excellent
7,0,4,Rs.,The Wine Company,"Italian, European","Cyber Hub, DLF Cyber City, Gurgaon",Gurgaon,Poor
8,0,4,Rs.,Farzi Cafe,Modern Indian,"38/39, Level 1, Block E , Inner Circle, Connau...",New Delhi,Very Good
9,1,3,Rs.,Indian Grill Room,"North Indian, Mughlai","315, 3rd Floor, Suncity Business Tower, Golf C...",Gurgaon,Excellent

In [63]:
df.tail()

,has_online_delivery,price_range,currency,name,cuisines,location.address,location.city,user_rating.rating_text
1175,0,3,£,The Boozy Cow,"Burger, Grill","17 Frederick Street, New Town, Edinburgh EH2 2EY",Edinburgh,Very Good
1176,0,3,£,La Favorita,Italian,"325-331 Leith Walk, Leith, Edinburgh EH6 8SA",Edinburgh,Excellent
1177,0,3,£,Roseleaf Bar Cafe,"Scottish, Cafe","23-24 Sandport Place, Leith, Edinburgh EH6 6EW",Edinburgh,Excellent
1178,0,3,£,Civerinos,"Pizza, Italian","5 Hunter Square, Royal Mile, Old Town, Edinbur...",Edinburgh,Good
1179,0,3,£,The Hanging Bat,American,"133 Lothian Road, Old Town, Edinburgh EH3 9AD",Edinburgh,Good

In [64]:
df.columns

Index(['has_online_delivery', 'price_range', 'currency', 'name', 'cuisines',
       'location.address', 'location.city', 'user_rating.rating_text'],
      dtype='object')

In [67]:
df.shape

(1180, 8)

In [68]:
df.dtypes

has_online_delivery         int64
price_range                 int64
currency                   object
name                       object
cuisines                   object
location.address           object
location.city              object
user_rating.rating_text    object
dtype: object

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1180 entries, 0 to 1179
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   has_online_delivery      1180 non-null   int64
 1   price_range              1180 non-null   int64
 2   currency                 1180 non-null   object
 3   name                     1180 non-null   object
 4   cuisines                 1180 non-null   object
 5   location.address         1180 non-null   object
 6   location.city            1180 non-null   object
 7   user_rating.rating_text  1180 non-null   object
dtypes: int64(2), object(6)
memory usage: 83.0+ KB